def zdh1():
    import random


    a = [random.randint(1, 10) for i in range(5)]
    b = int(input('Введите число:'))
    if b in a:
        print("Поздравляю, Вы угадали число!")
    else:
        print("Нет такого числа!")
    print('Были загаданы числа:', a)


def zdh2():
    my_list = [3, 8, 12, 6, 5, 8, 12]
    num = len(my_list)

    for x in range(0, num + 1):
        for y in range(x + 1, num ):
            if my_list[x] == my_list[y]:
                print("В списке есть повторение: ", my_list[x])


def zdh3():
    a = ('пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс')


    b = int(input('сколько выходных дней на неделе вы хотите?'))
    print('ваши выходные дни: ', a[-b:])
    print('ваши рабочие дни: ', a[:-b])


def zdh4():
    import random
    s = ["Финкельберг", "Гумерова", "Телятникова", "Назаренко", "Рахимов", "Шамбурова", "Шенфельд", "Тарнаева", "Жарко"]
    s1 = ["Павлова", "Денисов", "Куокканен", "Литвина", "Перцева", "Игнатьев", "Мунтян", "Ясюкевич", "Шабельская",
          "Григорчук"]
    s2 = random.sample(s, 5) + random.sample(s1, 5)
    r = len(s2)
    print("Первая группа", s)
    print("Вторая группа", s1)
    print("Команда", s2)
    print("Кол-во людей в команде", r)
    s2.sort()
    print("Команда по алфавиту", s2)
    if 'Иванов' in s2:
        k = s2.count('Иванов')
        print("Да, людей с фамилей Иванов в команде", k)
    else:
        print("Нет, Иванов не входит в команду")


zdh1()
zdh2()
zdh3()
zdh4()